[
    {
      "id": 1,
      "picture": "https://lamuseblue.s3.amazonaws.com/wp-content/uploads/2015/03/16044213/Chef-Massimo-Bottura.png",
      "name": "Massimo Bottura",
      "years_of_experience": 10,
      "num_of_recipes": 50,
      "likes": 1000,
      "bio": "Massimo Bottura is an Italian chef and the owner of Osteria Francescana, a three-Michelin-star restaurant in Modena, Italy. He is known for his innovative approach to Italian cuisine.",
      "recipes": [
        {
          "name": "Parmigiano Reggiano Five Ages",
          "ingredients": "Parmigiano Reggiano cheese, balsamic vinegar, white truffle oil, hazelnuts",
          "cooking_method": "1. Grate the Parmigiano Reggiano cheese.\n2. Toast the hazelnuts in a pan.\n3. Mix the grated cheese with balsamic vinegar and white truffle oil.\n4. Top with toasted hazelnuts. ",
          "rating": 4.5
        },
        {
          "name": "Risotto cacio e pepe",
          "ingredients": "Arborio rice, Pecorino Romano cheese, black pepper, butter",
          "cooking_method": "1. Toast the rice in a pan.\n2. Add hot water and stir until the rice is cooked.\n3. Add Pecorino Romano cheese, black pepper, and butter.\n4. Stir until the cheese is melted and serve.",
          "rating": 4.8
        },
        {
          "name": "Tortellini with Parmigiano Reggiano cream sauce",
          "ingredients": "Tortellini, heavy cream, Parmigiano Reggiano cheese, butter",
          "cooking_method": "1. Cook the tortellini according to the instructions on the package.\n2. In a pan, heat the heavy cream and butter.\n3. Add grated Parmigiano Reggiano cheese and stir until melted.\n4. Add the cooked tortellini and toss to coat with the sauce.",
          "rating": 4.3
        }
      ]
    },
    {
        "id": 2,
        "picture": "https://www.iitaly.org/sites/default/files/styles/article-slideshow-visual/public/slideshow_pro/marchesi.jpg",
        "name": "Gualtiero Marchesi",
        "years_of_experience": 5,
        "num_of_recipes": 30,
        "likes": 500,
        "bio": "Gualtiero Marchesi was an Italian chef and the founder of modern Italian cuisine. He was the first Italian chef to be awarded three Michelin stars.",
        "recipes": [
          {
            "name": "Risotto alla Milanese",
            "ingredients": "Carnaroli rice, beef stock, Parmigiano Reggiano cheese, saffron, butter",
            "cooking_method": "1. Toast the rice in a pan.\n2. Add hot beef stock and stir until the rice is cooked.\n3. Add saffron, grated Parmigiano Reggiano cheese, and butter.\n4. Stir until the cheese is melted and serve.",
            "rating": 4.5
          },
          {
            "name": "Osso buco alla milanese",
          "ingredients": "Veal shanks, beef stock, white wine, onion, celery, carrot, garlic, tomato paste, lemon zest, parsley",
          "cooking_method": "1. Brown the veal shanks in a pan.\n2. Add chopped onion, celery, carrot, and garlic.\n3. Add beef stock, white wine, tomato paste, and lemon zest.\n4. Cook on low heat for 2-3 hours until the meat is tender.\n5. Garnish with chopped parsley and serve.",
            "rating": 4.8
          },
          {
            "name": "Panna cotta",
            "ingredients": "Heavy cream, sugar, gelatin, vanilla extract, mixed berries",
            "cooking_method": "1. Heat the heavy cream and sugar in a pan.\n2. Add gelatin and stir until it dissolves.\n3. Add vanilla extract and stir until well combined.\n4. Pour the mixture into small cups and refrigerate for at least 2 hours.\n5. Serve with mixed berries on top.",
            "rating": 4.6
          }
        ]
      },
      {
        "id": 3,
        "picture": "https://www.wbpstars.com/wp-content/uploads/2021/02/Ristorante-Cracco-photo6016f0f813e86.jpg",
        "name": "Carlo Cracco",
        "years_of_experience": 12,
        "num_of_recipes": 70,
        "likes": 1200,
        "bio": "Carlo Cracco is an Italian chef and television personality. He is known for his modern interpretation of traditional Italian dishes.",
        "recipes": [
            {
              "name": "Spaghetti alla carbonara",
              "ingredients": "Spaghetti, guanciale (cured pork cheek), eggs, Pecorino Romano cheese, black pepper",
              "cooking_method": "1. Cook the spaghetti according to the instructions on the package.\n2. In a pan, sauté the guanciale until crispy.\n3. In a bowl, beat the eggs with grated Pecorino Romano cheese and black pepper.\n4. Drain the spaghetti and add it to the pan with guanciale.\n5. Turn off the heat and pour the egg mixture over the spaghetti.\n6. Stir until the eggs are cooked but still creamy.",
                "rating": 4.5
            },
            {
              "name": "Veal Milanese",
              "ingredients": "Veal cutlets, flour, eggs, breadcrumbs, lemon, butter",
              "cooking_method": "1. Season the veal cutlets with salt and pepper.\n2. Dredge the cutlets in flour, dip them in beaten eggs, and coat with breadcrumbs.\n3. In a pan, melt the butter and fry the cutlets until golden brown.\n4. Serve with a wedge of lemon.",
                "rating": 4.7
            },
            {
              "name": "Tiramisù",
              "ingredients": "Ladyfingers, espresso, mascarpone cheese, eggs, sugar, cocoa powder",
              "cooking_method": "1. Dip the ladyfingers in espresso and arrange them in a single layer in a dish.\n2. In a bowl, beat the egg yolks with sugar.\n3. Add the mascarpone cheese and mix well.\n4. In another bowl, beat the egg whites until stiff peaks form.\n5. Fold the egg whites into the mascarpone mixture.\n6. Spread the mixture over the ladyfingers.\n7. Dust with cocoa powder and refrigerate for at least 2 hours.",
                "rating": 4.9
            }
        ]
    },
    {
        "id": 4,
        "picture": "https://nypost.com/wp-content/uploads/sites/2/2013/08/092310eataly03vw183947-300x300.jpg?quality=75&strip=all",
        "name": "Lidia Bastianich",
        "years_of_experience": 10,
        "num_of_recipes": 50,
        "likes": 2000,
        "bio": "Lidia Bastianich is an Italian-American chef, television personality, and restaurateur. She is known for her traditional Italian dishes.",
        "recipes": [
          {
            "name": "Pasta e fagioli",
            "ingredients": "Cannellini beans, ditalini pasta, onion, carrot, celery, garlic, tomato paste, chicken broth, Parmigiano Reggiano cheese",
            "cooking_method": "1. Sauté chopped onion, carrot, celery, and garlic in a pan.\n2. Add tomato paste and cook for a minute.\n3. Add cannellini beans and chicken broth.\n4. Simmer for 10-15 minutes.\n5. Add ditalini pasta and cook until al dente.\n6. Serve with grated Parmigiano Reggiano cheese on top.",
            "rating": 4.5
          },
          {
            "name": "Orecchiette with broccoli rabe and sausage",
            "ingredients": "Orecchiette pasta, broccoli rabe, Italian sausage, garlic, red pepper flakes, Parmigiano Reggiano cheese",
            "cooking_method": "1. Cook the orecchiette pasta according to the instructions on the package.\n2. In a pan, cook crumbled Italian sausage until browned.\n3. Add minced garlic and red pepper flakes and cook for another minute.\n4. Add blanched broccoli rabe and sauté for a few minutes.\n5. Drain the pasta and add it to the pan with the sausage and broccoli rabe.\n6. Toss everything together.\n7. Serve with grated Parmigiano Reggiano cheese on top.",
            "rating": 4.0
          },
          {
            "name": "Torta della nonna",
"ingredients": "Pastry dough, milk, sugar, flour, eggs, lemon zest, pine nuts, powdered sugar",
"cooking_method": "1. Preheat the oven to 350°F.\n2. In a saucepan, heat milk, sugar, flour, and lemon zest until it thickens.\n3. In a bowl, beat the egg yolks and add them to the milk mixture.\n4. Roll out the pastry dough and use it to line a pie dish.\n5. Pour the milk mixture into the pastry shell.\n6. Sprinkle with pine nuts.\n7. Bake for 30-35 minutes, or until golden brown.\n8. Let it cool and dust with powdered sugar before serving.",
            "rating": 5.0
          }
        ]
      },
      {
        "id": 5,
        "picture": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRxv3wvjeCJO5N4d5KLeAGhlC1pZHaHG2E6Cg&usqp=CAU",
        "name": "Gennaro Contaldo",
        "years_of_experience": 20,
        "number_of_recipes": 50,
        "likes": 1200,
        "bio": "Gennaro Contaldo is an Italian chef and restaurateur. He is known for his traditional Neapolitan dishes.",
        "recipes": [
          {
            "name":"Spaghetti alla puttanesca",
            "ingredients": "Spaghetti pasta, canned tomatoes, olives, capers, anchovy fillets, garlic, red pepper flakes",
            "cooking_method": "1. Cook the spaghetti pasta according to the instructions on the package.\n2. In a pan, heat olive oil and sauté minced garlic and red pepper flakes.\n3. Add canned tomatoes and let it simmer for a few minutes.\n4. Add pitted olives, capers, and chopped anchovy fillets.\n5. Simmer for another few minutes.\n6. Drain the pasta and add it to the pan.\n7. Toss everything together.\n8. Serve hot.",
            "rating": 4.5
          },
          {
            "name": "Pizza Margherita",
            "ingredients": "Pizza dough, canned San Marzano tomatoes, fresh mozzarella cheese, basil leaves, extra-virgin olive oil",
            "cooking_method": "1. Preheat the oven to 450°F.\n2. Roll out the pizza dough and place it on a baking sheet.\n3. Spread canned San Marzano tomatoes on top of the dough.\n4. Add sliced fresh mozzarella cheese.\n5. Drizzle with extra-virgin olive oil.\n6. Bake in the oven for 12-15 minutes, or until the crust is golden brown and the cheese is melted.\n7. Top with fresh basil leaves before serving.",
            "rating": 4.8
          },
          {
            "name": "Zeppole",
"ingredients": "All-purpose flour, baking powder, salt, eggs, milk, sugar, lemon zest, vegetable oil",
"cooking_method": "1. In a bowl, mix together all-purpose flour, baking powder, and salt.\n2. In another bowl, beat eggs, milk, sugar, and lemon zest.\n3. Add the flour mixture to the egg mixture and stir until well combined.\n4. Heat vegetable oil in a pan.\n5. Using a spoon, drop small balls of batter into the hot oil.\n6. Fry until golden brown on both sides.\n7. Remove with a slotted spoon and drain on paper towels.\n8. Serve warm, dusted with powdered sugar.",
            "rating": 4.7
          }
        ]
      },
      {
        "id": 6,
        "picture": "https://www.finedininglovers.com/sites/g/files/xknfdk626/files/styles/open_graph_image/public/Gordon-Ramsay.jpg?itok=N_6PGd_H",
        "name": "Gordon Ramsay",
        "years_of_experience": 10,
        "num_of_recipes": 50,
        "likes": 1000,
        "bio": "Gordon Ramsay is a Italian-British chef, restaurateur, and television personality. He is known for his fiery personality and his expertise in French and British cuisine.",
        "recipes": [
          {
            "name": "Beef Wellington",
            "ingredients": "Beef tenderloin, puff pastry, prosciutto, cremini mushrooms, Dijon mustard, egg wash",
            "cooking_method": "1. Season the beef tenderloin with salt and pepper.\n2. In a pan, sear the beef tenderloin on all sides until browned.\n3. Set aside and let it cool.\n4. In the same pan, sauté chopped cremini mushrooms until softened.\n5. Spread Dijon mustard on a layer of prosciutto.\n6. Place the sautéed mushrooms on top of the prosciutto.\n7. Place the seared beef tenderloin on top of the mushrooms.\n8. Wrap the beef tenderloin in the prosciutto and mushrooms.\n9. Roll out the puff pastry and wrap the beef tenderloin with it.\n10. Brush the puff pastry with egg wash.\n11. Bake in the oven at 400°F for 30-40 minutes, or until the puff pastry is golden brown and the beef tenderloin is cooked to your desired doneness.\n12. Let it rest for 10 minutes before slicing and serving.",
            "rating": 4.5
          },
          {
            "name": "Lobster risotto",
            "ingredients": "Arborio rice, lobster tails, onion, garlic, white wine, chicken broth, Parmigiano Reggiano cheese, parsley",
            "cooking_method": "1. In a pot, heat chicken broth and keep it simmering.\n2. In another pot, sauté chopped onion and garlic until softened.\n3. Add Arborio rice and stir until coated with the onion mixture.\n4. Add white wine and stir until the liquid is absorbed.\n5. Add a ladleful of hot chicken broth to the rice and stir until the liquid is absorbed.\n6. Repeat with the remaining broth, stirring constantly, until the rice is tender but still has a bite to it.\n7. In a pan, cook lobster tails until pink.\n8. Remove the meat from the lobster tails and chop into bite-sized pieces.\n9. Add the chopped lobster meat to the risotto.\n10. Add grated Parmigiano Reggiano cheese and chopped parsley.\n11. Stir until everything is well combined.\n12. Serve hot.",
            "rating": 4.8
          },
          {
            "name": "Sticky toffee pudding",
            "ingredients": "Dates, all-purpose flour, baking powder, baking soda, salt, unsalted butter, brown sugar, eggs, vanilla extract, heavy cream",
            "cooking_method": "1. Preheat the oven to 350°F.\n2. In a bowl, soak chopped dates in hot water for 10 minutes.\n3. In another bowl, mix together all-purpose flour, baking powder, baking soda, and salt.\n4. In a stand mixer, beat unsalted butter and brown sugar until light and creamy.\n5. Add eggs, one at a time, and vanilla extract.\n6. Gradually add the flour mixture and mix until well combined.\n7. Add the soaked dates and mix until well combined.\n8. Pour the batter into a greased baking dish.\n9. Bake in the oven for 30-40 minutes, or until a toothpick inserted in the center comes out clean.\n10. In a saucepan, heat heavy cream and brown sugar until it starts to bubble and thicken.\n11. Remove the pan from the heat and stir in the butter until melted and fully combined.\n12. Pour the caramel sauce over the warm cake and let it soak in for a few minutes.\n13. Serve warm with a dollop of whipped cream, if desired.",
            "rating": 4.2
          }
        ]
      }
]